7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_FS.h
#define Get_OTG_FS_GLOBAL_OTG_FS_GOTGCTL(FLAG)(*(uint32_t*)0x50000000 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GOTGINT(FLAG)(*(uint32_t*)0x50000004 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GAHBCFG(FLAG)(*(uint32_t*)0x50000008 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GUSBCFG(FLAG)(*(uint32_t*)0x5000000c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRSTCTL(FLAG)(*(uint32_t*)0x50000010 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GINTSTS(FLAG)(*(uint32_t*)0x50000014 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GINTMSK(FLAG)(*(uint32_t*)0x50000018 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device(FLAG)(*(uint32_t*)0x5000001c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host(FLAG)(*(uint32_t*)0x5000001c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRXFSIZ(FLAG)(*(uint32_t*)0x50000024 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device(FLAG)(*(uint32_t*)0x50000028 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host(FLAG)(*(uint32_t*)0x50000028 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_HNPTXSTS(FLAG)(*(uint32_t*)0x5000002c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GCCFG(FLAG) (*(uint32_t*)0x50000038 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_CID(FLAG)   (*(uint32_t*)0x5000003c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ(FLAG)(*(uint32_t*)0x50000100 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF1(FLAG)(*(uint32_t*)0x50000104 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF2(FLAG)(*(uint32_t*)0x50000108 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF3(FLAG)(*(uint32_t*)0x5000010c & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device(FLAG)(*(uint32_t*)0x50000020 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host(FLAG)(*(uint32_t*)0x50000020 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GI2CCTL(FLAG)(*(uint32_t*)0x50000030 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GPWRDN(FLAG)(*(uint32_t*)0x50000058 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GADPCTL(FLAG)(*(uint32_t*)0x50000060 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF4(FLAG)(*(uint32_t*)0x50000110 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_DIEPTXF5(FLAG)(*(uint32_t*)0x50000114 & FLAG)
#define Get_OTG_FS_GLOBAL_OTG_FS_GLPMCFG(FLAG)(*(uint32_t*)0x50000054 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCFG(FLAG)    (*(uint32_t*)0x50000400 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HFIR(FLAG)    (*(uint32_t*)0x50000404 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HFNUM(FLAG)   (*(uint32_t*)0x50000408 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HPTXSTS(FLAG) (*(uint32_t*)0x50000410 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HAINT(FLAG)   (*(uint32_t*)0x50000414 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HAINTMSK(FLAG)(*(uint32_t*)0x50000418 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HPRT(FLAG)    (*(uint32_t*)0x50000440 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR0(FLAG) (*(uint32_t*)0x50000500 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR1(FLAG) (*(uint32_t*)0x50000520 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR2(FLAG) (*(uint32_t*)0x50000540 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR3(FLAG) (*(uint32_t*)0x50000560 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR4(FLAG) (*(uint32_t*)0x50000580 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR5(FLAG) (*(uint32_t*)0x500005a0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR6(FLAG) (*(uint32_t*)0x500005c0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR7(FLAG) (*(uint32_t*)0x500005e0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT0(FLAG)  (*(uint32_t*)0x50000508 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT1(FLAG)  (*(uint32_t*)0x50000528 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT2(FLAG)  (*(uint32_t*)0x50000548 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT3(FLAG)  (*(uint32_t*)0x50000568 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT4(FLAG)  (*(uint32_t*)0x50000588 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT5(FLAG)  (*(uint32_t*)0x500005a8 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT6(FLAG)  (*(uint32_t*)0x500005c8 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT7(FLAG)  (*(uint32_t*)0x500005e8 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK0(FLAG)(*(uint32_t*)0x5000050c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK1(FLAG)(*(uint32_t*)0x5000052c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK2(FLAG)(*(uint32_t*)0x5000054c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK3(FLAG)(*(uint32_t*)0x5000056c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK4(FLAG)(*(uint32_t*)0x5000058c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK5(FLAG)(*(uint32_t*)0x500005ac & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK6(FLAG)(*(uint32_t*)0x500005cc & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK7(FLAG)(*(uint32_t*)0x500005ec & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ0(FLAG) (*(uint32_t*)0x50000510 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ1(FLAG) (*(uint32_t*)0x50000530 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ2(FLAG) (*(uint32_t*)0x50000550 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ3(FLAG) (*(uint32_t*)0x50000570 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ4(FLAG) (*(uint32_t*)0x50000590 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ5(FLAG) (*(uint32_t*)0x500005b0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ6(FLAG) (*(uint32_t*)0x500005d0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ7(FLAG) (*(uint32_t*)0x500005f0 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR8(FLAG) (*(uint32_t*)0x500005f4 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT8(FLAG)  (*(uint32_t*)0x500005f8 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK8(FLAG)(*(uint32_t*)0x500005fc & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ8(FLAG) (*(uint32_t*)0x50000600 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR9(FLAG) (*(uint32_t*)0x50000604 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT9(FLAG)  (*(uint32_t*)0x50000608 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK9(FLAG)(*(uint32_t*)0x5000060c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ9(FLAG) (*(uint32_t*)0x50000610 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR10(FLAG)(*(uint32_t*)0x50000614 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT10(FLAG) (*(uint32_t*)0x50000618 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK10(FLAG)(*(uint32_t*)0x5000061c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ10(FLAG)(*(uint32_t*)0x50000620 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCCHAR11(FLAG)(*(uint32_t*)0x50000624 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINT11(FLAG) (*(uint32_t*)0x50000628 & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCINTMSK11(FLAG)(*(uint32_t*)0x5000062c & FLAG)
#define Get_OTG_FS_HOST_OTG_FS_HCTSIZ11(FLAG)(*(uint32_t*)0x50000630 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DCFG(FLAG)  (*(uint32_t*)0x50000800 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DCTL(FLAG)  (*(uint32_t*)0x50000804 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DSTS(FLAG)  (*(uint32_t*)0x50000808 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPMSK(FLAG)(*(uint32_t*)0x50000810 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPMSK(FLAG)(*(uint32_t*)0x50000814 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DAINT(FLAG) (*(uint32_t*)0x50000818 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DAINTMSK(FLAG)(*(uint32_t*)0x5000081c & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DVBUSDIS(FLAG)(*(uint32_t*)0x50000828 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DVBUSPULSE(FLAG)(*(uint32_t*)0x5000082c & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK(FLAG)(*(uint32_t*)0x50000834 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL0(FLAG)(*(uint32_t*)0x50000900 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL1(FLAG)(*(uint32_t*)0x50000920 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL2(FLAG)(*(uint32_t*)0x50000940 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL3(FLAG)(*(uint32_t*)0x50000960 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL0(FLAG)(*(uint32_t*)0x50000b00 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL1(FLAG)(*(uint32_t*)0x50000b20 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL2(FLAG)(*(uint32_t*)0x50000b40 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL3(FLAG)(*(uint32_t*)0x50000b60 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT0(FLAG)(*(uint32_t*)0x50000908 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT1(FLAG)(*(uint32_t*)0x50000928 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT2(FLAG)(*(uint32_t*)0x50000948 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT3(FLAG)(*(uint32_t*)0x50000968 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT0(FLAG)(*(uint32_t*)0x50000b08 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT1(FLAG)(*(uint32_t*)0x50000b28 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT2(FLAG)(*(uint32_t*)0x50000b48 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT3(FLAG)(*(uint32_t*)0x50000b68 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0(FLAG)(*(uint32_t*)0x50000910 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0(FLAG)(*(uint32_t*)0x50000b10 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1(FLAG)(*(uint32_t*)0x50000930 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2(FLAG)(*(uint32_t*)0x50000950 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3(FLAG)(*(uint32_t*)0x50000970 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS0(FLAG)(*(uint32_t*)0x50000918 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS1(FLAG)(*(uint32_t*)0x50000938 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS2(FLAG)(*(uint32_t*)0x50000958 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS3(FLAG)(*(uint32_t*)0x50000978 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1(FLAG)(*(uint32_t*)0x50000b30 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2(FLAG)(*(uint32_t*)0x50000b50 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3(FLAG)(*(uint32_t*)0x50000b70 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL4(FLAG)(*(uint32_t*)0x50000980 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT4(FLAG)(*(uint32_t*)0x50000988 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4(FLAG)(*(uint32_t*)0x50000994 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS4(FLAG)(*(uint32_t*)0x5000099c & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPCTL5(FLAG)(*(uint32_t*)0x500009a0 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPINT5(FLAG)(*(uint32_t*)0x500009a8 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55(FLAG)(*(uint32_t*)0x500009b0 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DTXFSTS55(FLAG)(*(uint32_t*)0x500009b8 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL4(FLAG)(*(uint32_t*)0x50000b78 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT4(FLAG)(*(uint32_t*)0x50000b80 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4(FLAG)(*(uint32_t*)0x50000b88 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPCTL5(FLAG)(*(uint32_t*)0x50000b90 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPINT5(FLAG)(*(uint32_t*)0x50000b98 & FLAG)
#define Get_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5(FLAG)(*(uint32_t*)0x50000ba0 & FLAG)
#define Get_OTG_FS_PWRCLK_OTG_FS_PCGCCTL(FLAG)(*(uint32_t*)0x50000e00 & FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GOTGCTL(FLAG)(*(uint32_t*)0x50000000 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GOTGCTL(FLAG)(*(uint32_t*)0x50000000 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GOTGINT(FLAG)(*(uint32_t*)0x50000004 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GOTGINT(FLAG)(*(uint32_t*)0x50000004 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GAHBCFG(FLAG)(*(uint32_t*)0x50000008 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GAHBCFG(FLAG)(*(uint32_t*)0x50000008 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GUSBCFG(FLAG)(*(uint32_t*)0x5000000c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GUSBCFG(FLAG)(*(uint32_t*)0x5000000c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRSTCTL(FLAG)(*(uint32_t*)0x50000010 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRSTCTL(FLAG)(*(uint32_t*)0x50000010 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GINTSTS(FLAG)(*(uint32_t*)0x50000014 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GINTSTS(FLAG)(*(uint32_t*)0x50000014 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GINTMSK(FLAG)(*(uint32_t*)0x50000018 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GINTMSK(FLAG)(*(uint32_t*)0x50000018 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device(FLAG)(*(uint32_t*)0x5000001c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device(FLAG)(*(uint32_t*)0x5000001c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host(FLAG)(*(uint32_t*)0x5000001c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host(FLAG)(*(uint32_t*)0x5000001c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRXFSIZ(FLAG)(*(uint32_t*)0x50000024 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRXFSIZ(FLAG)(*(uint32_t*)0x50000024 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device(FLAG)(*(uint32_t*)0x50000028 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device(FLAG)(*(uint32_t*)0x50000028 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host(FLAG)(*(uint32_t*)0x50000028 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host(FLAG)(*(uint32_t*)0x50000028 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_HNPTXSTS(FLAG)(*(uint32_t*)0x5000002c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_HNPTXSTS(FLAG)(*(uint32_t*)0x5000002c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GCCFG(FLAG) (*(uint32_t*)0x50000038 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GCCFG(FLAG) (*(uint32_t*)0x50000038 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_CID(FLAG)   (*(uint32_t*)0x5000003c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_CID(FLAG)   (*(uint32_t*)0x5000003c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ(FLAG)(*(uint32_t*)0x50000100 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ(FLAG)(*(uint32_t*)0x50000100 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF1(FLAG)(*(uint32_t*)0x50000104 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF1(FLAG)(*(uint32_t*)0x50000104 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF2(FLAG)(*(uint32_t*)0x50000108 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF2(FLAG)(*(uint32_t*)0x50000108 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF3(FLAG)(*(uint32_t*)0x5000010c |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF3(FLAG)(*(uint32_t*)0x5000010c &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device(FLAG)(*(uint32_t*)0x50000020 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device(FLAG)(*(uint32_t*)0x50000020 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host(FLAG)(*(uint32_t*)0x50000020 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host(FLAG)(*(uint32_t*)0x50000020 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GI2CCTL(FLAG)(*(uint32_t*)0x50000030 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GI2CCTL(FLAG)(*(uint32_t*)0x50000030 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GPWRDN(FLAG)(*(uint32_t*)0x50000058 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GPWRDN(FLAG)(*(uint32_t*)0x50000058 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GADPCTL(FLAG)(*(uint32_t*)0x50000060 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GADPCTL(FLAG)(*(uint32_t*)0x50000060 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF4(FLAG)(*(uint32_t*)0x50000110 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF4(FLAG)(*(uint32_t*)0x50000110 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_DIEPTXF5(FLAG)(*(uint32_t*)0x50000114 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_DIEPTXF5(FLAG)(*(uint32_t*)0x50000114 &= ~FLAG)
#define Set_OTG_FS_GLOBAL_OTG_FS_GLPMCFG(FLAG)(*(uint32_t*)0x50000054 |= FLAG)
#define Clr_OTG_FS_GLOBAL_OTG_FS_GLPMCFG(FLAG)(*(uint32_t*)0x50000054 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCFG(FLAG)    (*(uint32_t*)0x50000400 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCFG(FLAG)    (*(uint32_t*)0x50000400 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HFIR(FLAG)    (*(uint32_t*)0x50000404 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HFIR(FLAG)    (*(uint32_t*)0x50000404 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HFNUM(FLAG)   (*(uint32_t*)0x50000408 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HFNUM(FLAG)   (*(uint32_t*)0x50000408 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HPTXSTS(FLAG) (*(uint32_t*)0x50000410 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HPTXSTS(FLAG) (*(uint32_t*)0x50000410 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HAINT(FLAG)   (*(uint32_t*)0x50000414 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HAINT(FLAG)   (*(uint32_t*)0x50000414 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HAINTMSK(FLAG)(*(uint32_t*)0x50000418 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HAINTMSK(FLAG)(*(uint32_t*)0x50000418 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HPRT(FLAG)    (*(uint32_t*)0x50000440 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HPRT(FLAG)    (*(uint32_t*)0x50000440 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR0(FLAG) (*(uint32_t*)0x50000500 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR0(FLAG) (*(uint32_t*)0x50000500 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR1(FLAG) (*(uint32_t*)0x50000520 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR1(FLAG) (*(uint32_t*)0x50000520 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR2(FLAG) (*(uint32_t*)0x50000540 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR2(FLAG) (*(uint32_t*)0x50000540 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR3(FLAG) (*(uint32_t*)0x50000560 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR3(FLAG) (*(uint32_t*)0x50000560 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR4(FLAG) (*(uint32_t*)0x50000580 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR4(FLAG) (*(uint32_t*)0x50000580 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR5(FLAG) (*(uint32_t*)0x500005a0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR5(FLAG) (*(uint32_t*)0x500005a0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR6(FLAG) (*(uint32_t*)0x500005c0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR6(FLAG) (*(uint32_t*)0x500005c0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR7(FLAG) (*(uint32_t*)0x500005e0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR7(FLAG) (*(uint32_t*)0x500005e0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT0(FLAG)  (*(uint32_t*)0x50000508 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT0(FLAG)  (*(uint32_t*)0x50000508 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT1(FLAG)  (*(uint32_t*)0x50000528 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT1(FLAG)  (*(uint32_t*)0x50000528 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT2(FLAG)  (*(uint32_t*)0x50000548 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT2(FLAG)  (*(uint32_t*)0x50000548 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT3(FLAG)  (*(uint32_t*)0x50000568 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT3(FLAG)  (*(uint32_t*)0x50000568 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT4(FLAG)  (*(uint32_t*)0x50000588 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT4(FLAG)  (*(uint32_t*)0x50000588 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT5(FLAG)  (*(uint32_t*)0x500005a8 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT5(FLAG)  (*(uint32_t*)0x500005a8 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT6(FLAG)  (*(uint32_t*)0x500005c8 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT6(FLAG)  (*(uint32_t*)0x500005c8 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT7(FLAG)  (*(uint32_t*)0x500005e8 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT7(FLAG)  (*(uint32_t*)0x500005e8 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK0(FLAG)(*(uint32_t*)0x5000050c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK0(FLAG)(*(uint32_t*)0x5000050c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK1(FLAG)(*(uint32_t*)0x5000052c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK1(FLAG)(*(uint32_t*)0x5000052c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK2(FLAG)(*(uint32_t*)0x5000054c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK2(FLAG)(*(uint32_t*)0x5000054c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK3(FLAG)(*(uint32_t*)0x5000056c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK3(FLAG)(*(uint32_t*)0x5000056c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK4(FLAG)(*(uint32_t*)0x5000058c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK4(FLAG)(*(uint32_t*)0x5000058c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK5(FLAG)(*(uint32_t*)0x500005ac |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK5(FLAG)(*(uint32_t*)0x500005ac &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK6(FLAG)(*(uint32_t*)0x500005cc |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK6(FLAG)(*(uint32_t*)0x500005cc &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK7(FLAG)(*(uint32_t*)0x500005ec |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK7(FLAG)(*(uint32_t*)0x500005ec &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ0(FLAG) (*(uint32_t*)0x50000510 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ0(FLAG) (*(uint32_t*)0x50000510 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ1(FLAG) (*(uint32_t*)0x50000530 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ1(FLAG) (*(uint32_t*)0x50000530 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ2(FLAG) (*(uint32_t*)0x50000550 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ2(FLAG) (*(uint32_t*)0x50000550 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ3(FLAG) (*(uint32_t*)0x50000570 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ3(FLAG) (*(uint32_t*)0x50000570 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ4(FLAG) (*(uint32_t*)0x50000590 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ4(FLAG) (*(uint32_t*)0x50000590 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ5(FLAG) (*(uint32_t*)0x500005b0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ5(FLAG) (*(uint32_t*)0x500005b0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ6(FLAG) (*(uint32_t*)0x500005d0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ6(FLAG) (*(uint32_t*)0x500005d0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ7(FLAG) (*(uint32_t*)0x500005f0 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ7(FLAG) (*(uint32_t*)0x500005f0 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR8(FLAG) (*(uint32_t*)0x500005f4 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR8(FLAG) (*(uint32_t*)0x500005f4 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT8(FLAG)  (*(uint32_t*)0x500005f8 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT8(FLAG)  (*(uint32_t*)0x500005f8 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK8(FLAG)(*(uint32_t*)0x500005fc |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK8(FLAG)(*(uint32_t*)0x500005fc &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ8(FLAG) (*(uint32_t*)0x50000600 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ8(FLAG) (*(uint32_t*)0x50000600 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR9(FLAG) (*(uint32_t*)0x50000604 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR9(FLAG) (*(uint32_t*)0x50000604 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT9(FLAG)  (*(uint32_t*)0x50000608 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT9(FLAG)  (*(uint32_t*)0x50000608 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK9(FLAG)(*(uint32_t*)0x5000060c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK9(FLAG)(*(uint32_t*)0x5000060c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ9(FLAG) (*(uint32_t*)0x50000610 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ9(FLAG) (*(uint32_t*)0x50000610 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR10(FLAG)(*(uint32_t*)0x50000614 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR10(FLAG)(*(uint32_t*)0x50000614 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT10(FLAG) (*(uint32_t*)0x50000618 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT10(FLAG) (*(uint32_t*)0x50000618 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK10(FLAG)(*(uint32_t*)0x5000061c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK10(FLAG)(*(uint32_t*)0x5000061c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ10(FLAG)(*(uint32_t*)0x50000620 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ10(FLAG)(*(uint32_t*)0x50000620 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCCHAR11(FLAG)(*(uint32_t*)0x50000624 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCCHAR11(FLAG)(*(uint32_t*)0x50000624 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINT11(FLAG) (*(uint32_t*)0x50000628 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINT11(FLAG) (*(uint32_t*)0x50000628 &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCINTMSK11(FLAG)(*(uint32_t*)0x5000062c |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCINTMSK11(FLAG)(*(uint32_t*)0x5000062c &= ~FLAG)
#define Set_OTG_FS_HOST_OTG_FS_HCTSIZ11(FLAG)(*(uint32_t*)0x50000630 |= FLAG)
#define Clr_OTG_FS_HOST_OTG_FS_HCTSIZ11(FLAG)(*(uint32_t*)0x50000630 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DCFG(FLAG)  (*(uint32_t*)0x50000800 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DCFG(FLAG)  (*(uint32_t*)0x50000800 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DCTL(FLAG)  (*(uint32_t*)0x50000804 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DCTL(FLAG)  (*(uint32_t*)0x50000804 &= ~FLAG)
