7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_FS.h
#define Set_OTG_FS_DEVICE_OTG_FS_DSTS(FLAG)  (*(uint32_t*)0x50000808 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DSTS(FLAG)  (*(uint32_t*)0x50000808 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPMSK(FLAG)(*(uint32_t*)0x50000810 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPMSK(FLAG)(*(uint32_t*)0x50000810 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPMSK(FLAG)(*(uint32_t*)0x50000814 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPMSK(FLAG)(*(uint32_t*)0x50000814 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DAINT(FLAG) (*(uint32_t*)0x50000818 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DAINT(FLAG) (*(uint32_t*)0x50000818 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DAINTMSK(FLAG)(*(uint32_t*)0x5000081c |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DAINTMSK(FLAG)(*(uint32_t*)0x5000081c &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DVBUSDIS(FLAG)(*(uint32_t*)0x50000828 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DVBUSDIS(FLAG)(*(uint32_t*)0x50000828 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DVBUSPULSE(FLAG)(*(uint32_t*)0x5000082c |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DVBUSPULSE(FLAG)(*(uint32_t*)0x5000082c &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK(FLAG)(*(uint32_t*)0x50000834 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK(FLAG)(*(uint32_t*)0x50000834 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL0(FLAG)(*(uint32_t*)0x50000900 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL0(FLAG)(*(uint32_t*)0x50000900 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL1(FLAG)(*(uint32_t*)0x50000920 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL1(FLAG)(*(uint32_t*)0x50000920 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL2(FLAG)(*(uint32_t*)0x50000940 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL2(FLAG)(*(uint32_t*)0x50000940 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL3(FLAG)(*(uint32_t*)0x50000960 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL3(FLAG)(*(uint32_t*)0x50000960 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL0(FLAG)(*(uint32_t*)0x50000b00 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL0(FLAG)(*(uint32_t*)0x50000b00 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL1(FLAG)(*(uint32_t*)0x50000b20 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL1(FLAG)(*(uint32_t*)0x50000b20 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL2(FLAG)(*(uint32_t*)0x50000b40 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL2(FLAG)(*(uint32_t*)0x50000b40 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL3(FLAG)(*(uint32_t*)0x50000b60 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL3(FLAG)(*(uint32_t*)0x50000b60 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT0(FLAG)(*(uint32_t*)0x50000908 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT0(FLAG)(*(uint32_t*)0x50000908 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT1(FLAG)(*(uint32_t*)0x50000928 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT1(FLAG)(*(uint32_t*)0x50000928 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT2(FLAG)(*(uint32_t*)0x50000948 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT2(FLAG)(*(uint32_t*)0x50000948 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT3(FLAG)(*(uint32_t*)0x50000968 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT3(FLAG)(*(uint32_t*)0x50000968 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT0(FLAG)(*(uint32_t*)0x50000b08 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT0(FLAG)(*(uint32_t*)0x50000b08 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT1(FLAG)(*(uint32_t*)0x50000b28 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT1(FLAG)(*(uint32_t*)0x50000b28 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT2(FLAG)(*(uint32_t*)0x50000b48 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT2(FLAG)(*(uint32_t*)0x50000b48 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT3(FLAG)(*(uint32_t*)0x50000b68 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT3(FLAG)(*(uint32_t*)0x50000b68 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0(FLAG)(*(uint32_t*)0x50000910 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0(FLAG)(*(uint32_t*)0x50000910 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0(FLAG)(*(uint32_t*)0x50000b10 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0(FLAG)(*(uint32_t*)0x50000b10 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1(FLAG)(*(uint32_t*)0x50000930 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1(FLAG)(*(uint32_t*)0x50000930 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2(FLAG)(*(uint32_t*)0x50000950 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2(FLAG)(*(uint32_t*)0x50000950 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3(FLAG)(*(uint32_t*)0x50000970 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3(FLAG)(*(uint32_t*)0x50000970 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS0(FLAG)(*(uint32_t*)0x50000918 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS0(FLAG)(*(uint32_t*)0x50000918 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS1(FLAG)(*(uint32_t*)0x50000938 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS1(FLAG)(*(uint32_t*)0x50000938 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS2(FLAG)(*(uint32_t*)0x50000958 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS2(FLAG)(*(uint32_t*)0x50000958 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS3(FLAG)(*(uint32_t*)0x50000978 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS3(FLAG)(*(uint32_t*)0x50000978 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1(FLAG)(*(uint32_t*)0x50000b30 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1(FLAG)(*(uint32_t*)0x50000b30 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2(FLAG)(*(uint32_t*)0x50000b50 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2(FLAG)(*(uint32_t*)0x50000b50 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3(FLAG)(*(uint32_t*)0x50000b70 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3(FLAG)(*(uint32_t*)0x50000b70 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL4(FLAG)(*(uint32_t*)0x50000980 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL4(FLAG)(*(uint32_t*)0x50000980 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT4(FLAG)(*(uint32_t*)0x50000988 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT4(FLAG)(*(uint32_t*)0x50000988 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4(FLAG)(*(uint32_t*)0x50000994 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4(FLAG)(*(uint32_t*)0x50000994 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS4(FLAG)(*(uint32_t*)0x5000099c |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS4(FLAG)(*(uint32_t*)0x5000099c &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPCTL5(FLAG)(*(uint32_t*)0x500009a0 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPCTL5(FLAG)(*(uint32_t*)0x500009a0 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPINT5(FLAG)(*(uint32_t*)0x500009a8 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPINT5(FLAG)(*(uint32_t*)0x500009a8 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55(FLAG)(*(uint32_t*)0x500009b0 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55(FLAG)(*(uint32_t*)0x500009b0 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DTXFSTS55(FLAG)(*(uint32_t*)0x500009b8 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DTXFSTS55(FLAG)(*(uint32_t*)0x500009b8 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL4(FLAG)(*(uint32_t*)0x50000b78 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL4(FLAG)(*(uint32_t*)0x50000b78 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT4(FLAG)(*(uint32_t*)0x50000b80 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT4(FLAG)(*(uint32_t*)0x50000b80 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4(FLAG)(*(uint32_t*)0x50000b88 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4(FLAG)(*(uint32_t*)0x50000b88 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPCTL5(FLAG)(*(uint32_t*)0x50000b90 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPCTL5(FLAG)(*(uint32_t*)0x50000b90 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPINT5(FLAG)(*(uint32_t*)0x50000b98 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPINT5(FLAG)(*(uint32_t*)0x50000b98 &= ~FLAG)
#define Set_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5(FLAG)(*(uint32_t*)0x50000ba0 |= FLAG)
#define Clr_OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5(FLAG)(*(uint32_t*)0x50000ba0 &= ~FLAG)
#define Set_OTG_FS_PWRCLK_OTG_FS_PCGCCTL(FLAG)(*(uint32_t*)0x50000e00 |= FLAG)
#define Clr_OTG_FS_PWRCLK_OTG_FS_PCGCCTL(FLAG)(*(uint32_t*)0x50000e00 &= ~FLAG)
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQSCS                (0x1 << 0)    // Session request success
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQ                   (0x1 << 1)    // Session request
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNGSCS                (0x1 << 8)    // Host negotiation success
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNPRQ                 (0x1 << 9)    // HNP request
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HSHNPEN               (0x1 << 10)    // Host set HNP enable
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DHNPEN                (0x1 << 11)    // Device HNP enabled
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_CIDSTS                (0x1 << 16)    // Connector ID status
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DBCT                  (0x1 << 17)    // Long/short debounce time
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_ASVLD                 (0x1 << 18)    // A-session valid
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BSVLD                 (0x1 << 19)    // B-session valid
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOEN              (0x1 << 2)    // VBUS valid override enable
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOVAL             (0x1 << 3)    // VBUS valid override value
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOEN               (0x1 << 4)    // A-peripheral session valid override enable
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOVAL              (0x1 << 5)    // A-peripheral session valid override value
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOEN               (0x1 << 6)    // B-peripheral session valid override enable
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOVAL              (0x1 << 7)    // B-peripheral session valid override value
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_EHEN                  (0x1 << 12)    // Embedded host enable
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGCTL_OTGVER                (0x1 << 20)    // OTG version
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_SEDET                 (0x1 << 2)    // Session end detected
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_SRSSCHG               (0x1 << 8)    // Session request success status change
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNSSCHG               (0x1 << 9)    // Host negotiation success status change
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_HNGDET                (0x1 << 17)    // Host negotiation detected
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_ADTOCHG               (0x1 << 18)    // A-device timeout change
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_DBCDNE                (0x1 << 19)    // Debounce done
#define  _OTG_FS_GLOBAL_OTG_FS_GOTGINT_IDCHNG                (0x1 << 20)    // ID input pin changed
#define  _OTG_FS_GLOBAL_OTG_FS_GAHBCFG_GINT                  (0x1 << 0)    // Global interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GAHBCFG_TXFELVL               (0x1 << 7)    // TxFIFO empty level
#define  _OTG_FS_GLOBAL_OTG_FS_GAHBCFG_PTXFELVL              (0x1 << 8)    // Periodic TxFIFO empty level
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TOCAL                 (0x7 << 0)    // FS timeout calibration
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_PHYSEL                (0x1 << 6)    // Full Speed serial transceiver select
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_SRPCAP                (0x1 << 8)    // SRP-capable
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_HNPCAP                (0x1 << 9)    // HNP-capable
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_TRDT                  (0xf << 10)    // USB turnaround time
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FHMOD                 (0x1 << 29)    // Force host mode
#define  _OTG_FS_GLOBAL_OTG_FS_GUSBCFG_FDMOD                 (0x1 << 30)    // Force device mode
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_CSRST                 (0x1 << 0)    // Core soft reset
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_HSRST                 (0x1 << 1)    // HCLK soft reset
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_FCRST                 (0x1 << 2)    // Host frame counter reset
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_RXFFLSH               (0x1 << 4)    // RxFIFO flush
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFFLSH               (0x1 << 5)    // TxFIFO flush
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_TXFNUM                (0x1f << 6)    // TxFIFO number
#define  _OTG_FS_GLOBAL_OTG_FS_GRSTCTL_AHBIDL                (0x1 << 31)    // AHB master idle
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_CMOD                  (0x1 << 0)    // Current mode of operation
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_MMIS                  (0x1 << 1)    // Mode mismatch interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_OTGINT                (0x1 << 2)    // OTG interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_SOF                   (0x1 << 3)    // Start of frame
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_RXFLVL                (0x1 << 4)    // RxFIFO non-empty
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_NPTXFE                (0x1 << 5)    // Non-periodic TxFIFO empty
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_GINAKEFF              (0x1 << 6)    // Global IN non-periodic NAK effective
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_GOUTNAKEFF            (0x1 << 7)    // Global OUT NAK effective
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_ESUSP                 (0x1 << 10)    // Early suspend
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBSUSP               (0x1 << 11)    // USB suspend
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_USBRST                (0x1 << 12)    // USB reset
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_ENUMDNE               (0x1 << 13)    // Enumeration done
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_ISOODRP               (0x1 << 14)    // Isochronous OUT packet dropped interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_EOPF                  (0x1 << 15)    // End of periodic frame interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_IEPINT                (0x1 << 18)    // IN endpoint interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_OEPINT                (0x1 << 19)    // OUT endpoint interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_IISOIXFR              (0x1 << 20)    // Incomplete isochronous IN transfer
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_IPXFR_INCOMPISOOUT    (0x1 << 21)    // Incomplete periodic transfer(Host mode)/Incomplete isochronous OUT transfer(Device mode)
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_HPRTINT               (0x1 << 24)    // Host port interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_HCINT                 (0x1 << 25)    // Host channels interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_PTXFE                 (0x1 << 26)    // Periodic TxFIFO empty
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_CIDSCHG               (0x1 << 28)    // Connector ID status change
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_DISCINT               (0x1 << 29)    // Disconnect detected interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_SRQINT                (0x1 << 30)    // Session request/new session detected interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_WKUPINT               (0x1 << 31)    // Resume/remote wakeup detected interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTSTS_RSTDET                (0x1 << 23)    // Reset detected interrupt
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_MMISM                 (0x1 << 1)    // Mode mismatch interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_OTGINT                (0x1 << 2)    // OTG interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_SOFM                  (0x1 << 3)    // Start of frame mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_RXFLVLM               (0x1 << 4)    // Receive FIFO non-empty mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_NPTXFEM               (0x1 << 5)    // Non-periodic TxFIFO empty mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_GINAKEFFM             (0x1 << 6)    // Global non-periodic IN NAK effective mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_GONAKEFFM             (0x1 << 7)    // Global OUT NAK effective mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_ESUSPM                (0x1 << 10)    // Early suspend mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBSUSPM              (0x1 << 11)    // USB suspend mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBRST                (0x1 << 12)    // USB reset mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_ENUMDNEM              (0x1 << 13)    // Enumeration done mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_ISOODRPM              (0x1 << 14)    // Isochronous OUT packet dropped interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_EOPFM                 (0x1 << 15)    // End of periodic frame interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_IEPINT                (0x1 << 18)    // IN endpoints interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_OEPINT                (0x1 << 19)    // OUT endpoints interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_IISOIXFRM             (0x1 << 20)    // Incomplete isochronous IN transfer mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_IPXFRM_IISOOXFRM      (0x1 << 21)    // Incomplete periodic transfer mask(Host mode)/Incomplete isochronous OUT transfer mask(Device mode)
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_PRTIM                 (0x1 << 24)    // Host port interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_HCIM                  (0x1 << 25)    // Host channels interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_PTXFEM                (0x1 << 26)    // Periodic TxFIFO empty mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_CIDSCHGM              (0x1 << 28)    // Connector ID status change mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_DISCINT               (0x1 << 29)    // Disconnect detected interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_SRQIM                 (0x1 << 30)    // Session request/new session detected interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_WUIM                  (0x1 << 31)    // Resume/remote wakeup detected interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_RSTDETM               (0x1 << 23)    // Reset detected interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GINTMSK_LPMIN                 (0x1 << 27)    // LPM interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_EPNUM          (0xf << 0)    // Endpoint number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_BCNT           (0x7ff << 4)    // Byte count
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_DPID           (0x3 << 15)    // Data PID
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_PKTSTS         (0xf << 17)    // Packet status
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_FRMNUM         (0xf << 21)    // Frame number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_CHNUM            (0xf << 0)    // Endpoint number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_BCNT             (0x7ff << 4)    // Byte count
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_DPID             (0x3 << 15)    // Data PID
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_PKTSTS           (0xf << 17)    // Packet status
#define  _OTG_FS_GLOBAL_OTG_FS_GRXFSIZ_RXFD                  (0xffff << 0)    // RxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FSA        (0xffff << 0)    // Endpoint 0 transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FD         (0xffff << 16)    // Endpoint 0 TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFSA        (0xffff << 0)    // Non-periodic transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFD         (0xffff << 16)    // Non-periodic TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXFSAV             (0xffff << 0)    // Non-periodic TxFIFO space available
#define  _OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTQXSAV             (0xff << 16)    // Non-periodic transmit request queue space available
#define  _OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXQTOP             (0x7f << 24)    // Top of the non-periodic transmit request queue
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_PWRDWN                  (0x1 << 16)    // Power down
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_BCDEN                   (0x1 << 17)    // Battery charging detector (BCD) enable
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDEN                   (0x1 << 18)    // Data contact detection (DCD) mode enable
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_PDEN                    (0x1 << 19)    // Primary detection (PD) mode enable
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_SDEN                    (0x1 << 20)    // Secondary detection (SD) mode enable
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_VBDEN                   (0x1 << 21)    // USB VBUS detection enable
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDET                   (0x1 << 0)    // Data contact detection (DCD) status
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_PDET                    (0x1 << 1)    // Primary detection (PD) status
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_SDET                    (0x1 << 2)    // Secondary detection (SD) status
#define  _OTG_FS_GLOBAL_OTG_FS_GCCFG_PS2DET                  (0x1 << 3)    // DM pull-up detection status
#define  _OTG_FS_GLOBAL_OTG_FS_CID_PRODUCT_ID                (0xffffffff << 0)    // Product ID field
#define  _OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXSA                (0xffff << 0)    // Host periodic TxFIFO start address
#define  _OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ_PTXFSIZ              (0xffff << 16)    // Host periodic TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXSA             (0xffff << 0)    // IN endpoint FIFO2 transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF1_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXSA             (0xffff << 0)    // IN endpoint FIFO3 transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF2_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXSA             (0xffff << 0)    // IN endpoint FIFO4 transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF3_INEPTXFD             (0xffff << 16)    // IN endpoint TxFIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_EPNUM          (0xf << 0)    // Endpoint number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_BCNT           (0x7ff << 4)    // Byte count
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_DPID           (0x3 << 15)    // Data PID
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_PKTSTS         (0xf << 17)    // Packet status
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_FRMNUM         (0xf << 21)    // Frame number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_CHNUM            (0xf << 0)    // Channel number
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_BCNT             (0x7ff << 4)    // Byte count
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_DPID             (0x3 << 15)    // Data PID
#define  _OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_PKTSTS           (0xf << 17)    // Packet status
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RWDATA                (0xff << 0)    // I2C Read/Write Data
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_REGADDR               (0xff << 8)    // I2C Register Address
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ADDR                  (0x7f << 16)    // I2C Address
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CEN                 (0x1 << 23)    // I2C Enable
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ACK                   (0x1 << 24)    // I2C ACK
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDEVADR             (0x3 << 26)    // I2C Device Address
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDATSE0             (0x1 << 28)    // I2C DatSe0 USB mode
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RW                    (0x1 << 30)    // Read/Write Indicator
#define  _OTG_FS_GLOBAL_OTG_FS_GI2CCTL_BSYDNE                (0x1 << 31)    // I2C Busy/Done
#define  _OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPMEN                 (0x1 << 0)    // ADP module enable
#define  _OTG_FS_GLOBAL_OTG_FS_GPWRDN_ADPIF                  (0x1 << 23)    // ADP interrupt flag
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDSCHG              (0x3 << 0)    // Probe discharge
