7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_FS.h
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBDELTA              (0x3 << 2)    // Probe delta
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_PRBPER                (0x3 << 4)    // Probe period
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_RTIM                  (0x7ff << 6)    // Ramp time
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENAPRB                (0x1 << 17)    // Enable probe
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ENASNS                (0x1 << 18)    // Enable sense
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPRST                (0x1 << 19)    // ADP reset
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPEN                 (0x1 << 20)    // ADP enable
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIF              (0x1 << 21)    // ADP probe interrupt flag
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIF              (0x1 << 22)    // ADP sense interrupt flag
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIF               (0x1 << 23)    // ADP timeout interrupt flag
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPPRBIM              (0x1 << 24)    // ADP probe interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPSNSIM              (0x1 << 25)    // ADP sense interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_ADPTOIM               (0x1 << 26)    // ADP timeout interrupt mask
#define  _OTG_FS_GLOBAL_OTG_FS_GADPCTL_AR                    (0x3 << 27)    // Access request
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF4_INEPTXFD             (0xffff << 16)    // IN endpoint Tx FIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXSA             (0xffff << 0)    // IN endpoint FIFOx transmit RAM start address
#define  _OTG_FS_GLOBAL_OTG_FS_DIEPTXF5_INEPTXFD             (0xffff << 16)    // IN endpoint Tx FIFO depth
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMEN                 (0x1 << 0)    // LPM support enable
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMACK                (0x1 << 1)    // LPM token acknowledge enable
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESL                  (0xf << 2)    // Best effort service latency
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_REMWAKE               (0x1 << 6)    // bRemoteWake value
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1SSEN                (0x1 << 7)    // L1 Shallow Sleep enable
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_BESLTHRS              (0xf << 8)    // BESL threshold
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1DSEN                (0x1 << 12)    // L1 deep sleep enable
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRST                (0x3 << 13)    // LPM response
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SLPSTS                (0x1 << 15)    // Port sleep status
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_L1RSMOK               (0x1 << 16)    // Sleep State Resume OK
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMCHIDX              (0xf << 17)    // LPM Channel Index
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNT               (0x7 << 21)    // LPM retry count
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_SNDLPM                (0x1 << 24)    // Send LPM transaction
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNTSTS            (0x7 << 25)    // LPM retry count status
#define  _OTG_FS_GLOBAL_OTG_FS_GLPMCFG_ENBESL                (0x1 << 28)    // Enable best effort service latency
#define  _OTG_FS_HOST_OTG_FS_HCFG_FSLSPCS                    (0x3 << 0)    // FS/LS PHY clock select
#define  _OTG_FS_HOST_OTG_FS_HCFG_FSLSS                      (0x1 << 2)    // FS- and LS-only support
#define  _OTG_FS_HOST_OTG_FS_HFIR_FRIVL                      (0xffff << 0)    // Frame interval
#define  _OTG_FS_HOST_OTG_FS_HFNUM_FRNUM                     (0xffff << 0)    // Frame number
#define  _OTG_FS_HOST_OTG_FS_HFNUM_FTREM                     (0xffff << 16)    // Frame time remaining
#define  _OTG_FS_HOST_OTG_FS_HPTXSTS_PTXFSAVL                (0xffff << 0)    // Periodic transmit data FIFO space available
#define  _OTG_FS_HOST_OTG_FS_HPTXSTS_PTXQSAV                 (0xff << 16)    // Periodic transmit request queue space available
#define  _OTG_FS_HOST_OTG_FS_HPTXSTS_PTXQTOP                 (0xff << 24)    // Top of the periodic transmit request queue
#define  _OTG_FS_HOST_OTG_FS_HAINT_HAINT                     (0xffff << 0)    // Channel interrupts
#define  _OTG_FS_HOST_OTG_FS_HAINTMSK_HAINTM                 (0xffff << 0)    // Channel interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HPRT_PCSTS                      (0x1 << 0)    // Port connect status
#define  _OTG_FS_HOST_OTG_FS_HPRT_PCDET                      (0x1 << 1)    // Port connect detected
#define  _OTG_FS_HOST_OTG_FS_HPRT_PENA                       (0x1 << 2)    // Port enable
#define  _OTG_FS_HOST_OTG_FS_HPRT_PENCHNG                    (0x1 << 3)    // Port enable/disable change
#define  _OTG_FS_HOST_OTG_FS_HPRT_POCA                       (0x1 << 4)    // Port overcurrent active
#define  _OTG_FS_HOST_OTG_FS_HPRT_POCCHNG                    (0x1 << 5)    // Port overcurrent change
#define  _OTG_FS_HOST_OTG_FS_HPRT_PRES                       (0x1 << 6)    // Port resume
#define  _OTG_FS_HOST_OTG_FS_HPRT_PSUSP                      (0x1 << 7)    // Port suspend
#define  _OTG_FS_HOST_OTG_FS_HPRT_PRST                       (0x1 << 8)    // Port reset
#define  _OTG_FS_HOST_OTG_FS_HPRT_PLSTS                      (0x3 << 10)    // Port line status
#define  _OTG_FS_HOST_OTG_FS_HPRT_PPWR                       (0x1 << 12)    // Port power
#define  _OTG_FS_HOST_OTG_FS_HPRT_PTCTL                      (0xf << 13)    // Port test control
#define  _OTG_FS_HOST_OTG_FS_HPRT_PSPD                       (0x3 << 17)    // Port speed
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR0_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR1_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR2_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR3_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR4_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR5_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR6_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR7_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCINT0_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT0_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT0_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT0_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT0_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT0_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT0_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT0_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT0_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT1_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT1_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT1_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT1_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT1_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT1_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT1_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT1_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT1_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT2_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT2_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT2_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT2_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT2_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT2_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT2_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT2_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT2_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT3_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT3_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT3_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT3_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT3_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT3_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT3_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT3_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT3_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT4_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT4_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT4_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT4_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT4_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT4_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT4_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT4_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT4_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT5_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT5_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT5_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT5_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT5_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT5_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT5_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT5_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT5_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT6_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT6_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT6_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT6_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT6_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT6_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT6_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT6_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT6_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINT7_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT7_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT7_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT7_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT7_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT7_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT7_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT7_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT7_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK0_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK1_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK2_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_STALLM                (0x1 << 3)    // STALL response received interrupt mask
