7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_FS.h
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK3_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK4_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK5_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK6_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK7_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ0_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ0_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ0_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ1_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ1_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ1_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ2_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ2_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ2_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ3_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ3_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ3_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ4_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ4_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ4_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ5_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ5_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ5_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ6_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ6_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ6_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ7_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ7_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ7_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR8_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCINT8_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT8_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT8_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT8_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT8_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT8_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT8_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT8_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT8_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_TXERRM                (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK8_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ8_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ8_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ8_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_MPSIZ                   (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_EPNUM                   (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_EPDIR                   (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_LSDEV                   (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_EPTYP                   (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_MCNT                    (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_DAD                     (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_ODDFRM                  (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_CHDIS                   (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR9_CHENA                   (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCINT9_XFRC                     (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT9_CHH                      (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT9_STALL                    (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT9_NAK                      (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT9_ACK                      (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT9_TXERR                    (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT9_BBERR                    (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT9_FRMOR                    (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT9_DTERR                    (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_XFRCM                 (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_CHHM                  (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_STALLM                (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_NAKM                  (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_ACKM                  (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_NYET                  (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_TXERRM                (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_BBERRM                (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_FRMORM                (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK9_DTERRM                (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ9_XFRSIZ                  (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ9_PKTCNT                  (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ9_DPID                    (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_MCNT                   (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_DAD                    (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR10_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCINT10_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT10_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT10_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT10_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT10_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT10_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT10_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT10_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT10_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_NYET                 (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_TXERRM               (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_BBERRM               (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK10_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ10_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ10_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ10_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_MPSIZ                  (0x7ff << 0)    // Maximum packet size
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_EPNUM                  (0xf << 11)    // Endpoint number
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_EPDIR                  (0x1 << 15)    // Endpoint direction
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_LSDEV                  (0x1 << 17)    // Low-speed device
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_EPTYP                  (0x3 << 18)    // Endpoint type
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_MCNT                   (0x3 << 20)    // Multicount
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_DAD                    (0x7f << 22)    // Device address
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_ODDFRM                 (0x1 << 29)    // Odd frame
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_CHDIS                  (0x1 << 30)    // Channel disable
#define  _OTG_FS_HOST_OTG_FS_HCCHAR11_CHENA                  (0x1 << 31)    // Channel enable
#define  _OTG_FS_HOST_OTG_FS_HCINT11_XFRC                    (0x1 << 0)    // Transfer completed
#define  _OTG_FS_HOST_OTG_FS_HCINT11_CHH                     (0x1 << 1)    // Channel halted
#define  _OTG_FS_HOST_OTG_FS_HCINT11_STALL                   (0x1 << 3)    // STALL response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT11_NAK                     (0x1 << 4)    // NAK response received interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT11_ACK                     (0x1 << 5)    // ACK response received/transmitted interrupt
#define  _OTG_FS_HOST_OTG_FS_HCINT11_TXERR                   (0x1 << 7)    // Transaction error
#define  _OTG_FS_HOST_OTG_FS_HCINT11_BBERR                   (0x1 << 8)    // Babble error
#define  _OTG_FS_HOST_OTG_FS_HCINT11_FRMOR                   (0x1 << 9)    // Frame overrun
#define  _OTG_FS_HOST_OTG_FS_HCINT11_DTERR                   (0x1 << 10)    // Data toggle error
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_XFRCM                (0x1 << 0)    // Transfer completed mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_CHHM                 (0x1 << 1)    // Channel halted mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_STALLM               (0x1 << 3)    // STALL response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_NAKM                 (0x1 << 4)    // NAK response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_ACKM                 (0x1 << 5)    // ACK response received/transmitted interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_NYET                 (0x1 << 6)    // response received interrupt mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_TXERRM               (0x1 << 7)    // Transaction error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_BBERRM               (0x1 << 8)    // Babble error mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_FRMORM               (0x1 << 9)    // Frame overrun mask
#define  _OTG_FS_HOST_OTG_FS_HCINTMSK11_DTERRM               (0x1 << 10)    // Data toggle error mask
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ11_XFRSIZ                 (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ11_PKTCNT                 (0x3ff << 19)    // Packet count
#define  _OTG_FS_HOST_OTG_FS_HCTSIZ11_DPID                   (0x3 << 29)    // Data PID
#define  _OTG_FS_DEVICE_OTG_FS_DCFG_DSPD                     (0x3 << 0)    // Device speed
#define  _OTG_FS_DEVICE_OTG_FS_DCFG_NZLSOHSK                 (0x1 << 2)    // Non-zero-length status OUT handshake
#define  _OTG_FS_DEVICE_OTG_FS_DCFG_DAD                      (0x7f << 4)    // Device address
#define  _OTG_FS_DEVICE_OTG_FS_DCFG_PFIVL                    (0x3 << 11)    // Periodic frame interval
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_RWUSIG                   (0x1 << 0)    // Remote wakeup signaling
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_SDIS                     (0x1 << 1)    // Soft disconnect
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_GINSTS                   (0x1 << 2)    // Global IN NAK status
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_GONSTS                   (0x1 << 3)    // Global OUT NAK status
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_TCTL                     (0x7 << 4)    // Test control
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_SGINAK                   (0x1 << 7)    // Set global IN NAK
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_CGINAK                   (0x1 << 8)    // Clear global IN NAK
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_SGONAK                   (0x1 << 9)    // Set global OUT NAK
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_CGONAK                   (0x1 << 10)    // Clear global OUT NAK
#define  _OTG_FS_DEVICE_OTG_FS_DCTL_POPRGDNE                 (0x1 << 11)    // Power-on programming done
#define  _OTG_FS_DEVICE_OTG_FS_DSTS_SUSPSTS                  (0x1 << 0)    // Suspend status
#define  _OTG_FS_DEVICE_OTG_FS_DSTS_ENUMSPD                  (0x3 << 1)    // Enumerated speed
#define  _OTG_FS_DEVICE_OTG_FS_DSTS_EERR                     (0x1 << 3)    // Erratic error
#define  _OTG_FS_DEVICE_OTG_FS_DSTS_FNSOF                    (0x3fff << 8)    // Frame number of the received SOF
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_XFRCM                 (0x1 << 0)    // Transfer completed interrupt mask
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_EPDM                  (0x1 << 1)    // Endpoint disabled interrupt mask
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_TOM                   (0x1 << 3)    // Timeout condition mask (Non-isochronous endpoints)
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_ITTXFEMSK             (0x1 << 4)    // IN token received when TxFIFO empty mask
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNMM               (0x1 << 5)    // IN token received with EP mismatch mask
#define  _OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNEM               (0x1 << 6)    // IN endpoint NAK effective mask
#define  _OTG_FS_DEVICE_OTG_FS_DOEPMSK_XFRCM                 (0x1 << 0)    // Transfer completed interrupt mask
#define  _OTG_FS_DEVICE_OTG_FS_DOEPMSK_EPDM                  (0x1 << 1)    // Endpoint disabled interrupt mask
#define  _OTG_FS_DEVICE_OTG_FS_DOEPMSK_STUPM                 (0x1 << 3)    // SETUP phase done mask
#define  _OTG_FS_DEVICE_OTG_FS_DOEPMSK_OTEPDM                (0x1 << 4)    // OUT token received when endpoint disabled mask
#define  _OTG_FS_DEVICE_OTG_FS_DAINT_IEPINT                  (0xffff << 0)    // IN endpoint interrupt bits
#define  _OTG_FS_DEVICE_OTG_FS_DAINT_OEPINT                  (0xffff << 16)    // OUT endpoint interrupt bits
#define  _OTG_FS_DEVICE_OTG_FS_DAINTMSK_IEPM                 (0xffff << 0)    // IN EP interrupt mask bits
#define  _OTG_FS_DEVICE_OTG_FS_DAINTMSK_OEPINT               (0xffff << 16)    // OUT endpoint interrupt bits
#define  _OTG_FS_DEVICE_OTG_FS_DVBUSDIS_VBUSDT               (0xffff << 0)    // Device VBUS discharge time
#define  _OTG_FS_DEVICE_OTG_FS_DVBUSPULSE_DVBUSP             (0xfff << 0)    // Device VBUS pulsing time
#define  _OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK_INEPTXFEM          (0xffff << 0)    // IN EP Tx FIFO empty interrupt mask bits
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_MPSIZ                (0x3 << 0)    // Maximum packet size
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_USBAEP               (0x1 << 15)    // USB active endpoint
