7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_USB_OTG_FS.h
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_NAKSTS               (0x1 << 17)    // NAK status
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPTYP                (0x3 << 18)    // Endpoint type
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_STALL                (0x1 << 21)    // STALL handshake
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_TXFNUM               (0xf << 22)    // TxFIFO number
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_CNAK                 (0x1 << 26)    // Clear NAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_SNAK                 (0x1 << 27)    // Set NAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPDIS                (0x1 << 30)    // Endpoint disable
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPENA                (0x1 << 31)    // Endpoint enable
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SODDFRM_SD1PID       (0x1 << 29)    // SODDFRM/SD1PID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_TXFNUM               (0xf << 22)    // TXFNUM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL1_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_TXFNUM               (0xf << 22)    // TXFNUM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL2_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_TXFNUM               (0xf << 22)    // TXFNUM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL3_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL0_MPSIZ                (0x3 << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL1_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL2_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL3_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT0_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT1_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT2_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT3_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT0_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT0_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT0_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT0_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT0_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT1_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT1_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT1_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT1_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT1_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT2_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT2_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT2_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT2_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT2_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT3_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT3_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT3_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT3_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT3_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_PKTCNT              (0x3 << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_XFRSIZ              (0x7f << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_STUPCNT             (0x3 << 29)    // SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_PKTCNT              (0x1 << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_XFRSIZ              (0x7f << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS0_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS1_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS2_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS3_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_TXFNUM               (0xf << 22)    // TXFNUM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL4_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT4_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_MCNT                (0x3 << 29)    // Multi count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS4_INEPTFSAV            (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_TXFNUM               (0xf << 22)    // TXFNUM
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DIEPCTL5_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_TXFE                 (0x1 << 7)    // TXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_INEPNE               (0x1 << 6)    // INEPNE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_ITTXFE               (0x1 << 4)    // ITTXFE
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_TOC                  (0x1 << 3)    // TOC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DIEPINT5_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_MCNT               (0x3 << 29)    // Multi count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_PKTCNT             (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_XFRSIZ             (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DTXFSTS55_INEPTFSAV           (0xffff << 0)    // IN endpoint TxFIFO space available
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL4_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT4_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT4_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT4_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT4_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT4_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPENA                (0x1 << 31)    // EPENA
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPDIS                (0x1 << 30)    // EPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SODDFRM              (0x1 << 29)    // SODDFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SD0PID_SEVNFRM       (0x1 << 28)    // SD0PID/SEVNFRM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNAK                 (0x1 << 27)    // SNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_CNAK                 (0x1 << 26)    // CNAK
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_Stall                (0x1 << 21)    // Stall
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNPM                 (0x1 << 20)    // SNPM
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPTYP                (0x3 << 18)    // EPTYP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_NAKSTS               (0x1 << 17)    // NAKSTS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EONUM_DPID           (0x1 << 16)    // EONUM/DPID
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_USBAEP               (0x1 << 15)    // USBAEP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPCTL5_MPSIZ                (0x7ff << 0)    // MPSIZ
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT5_B2BSTUP              (0x1 << 6)    // B2BSTUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT5_OTEPDIS              (0x1 << 4)    // OTEPDIS
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT5_STUP                 (0x1 << 3)    // STUP
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT5_EPDISD               (0x1 << 1)    // EPDISD
#define  _OTG_FS_DEVICE_OTG_FS_DOEPINT5_XFRC                 (0x1 << 0)    // XFRC
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_RXDPID_STUPCNT      (0x3 << 29)    // Received data PID/SETUP packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_PKTCNT              (0x3ff << 19)    // Packet count
#define  _OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_XFRSIZ              (0x7ffff << 0)    // Transfer size
#define  _OTG_FS_PWRCLK_OTG_FS_PCGCCTL_STPPCLK               (0x1 << 0)    // Stop PHY clock
#define  _OTG_FS_PWRCLK_OTG_FS_PCGCCTL_GATEHCLK              (0x1 << 1)    // Gate HCLK
#define  _OTG_FS_PWRCLK_OTG_FS_PCGCCTL_PHYSUSP               (0x1 << 4)    // PHY Suspended
